# Homebrew taps
tap "homebrew/bundle" # Bundle管理を行うための公式タップ
tap "homebrew/cask-fonts" # フォント関連のCaskをインストールするためのタップ
tap "homebrew/services" # サービス管理用のタップ（起動や停止などを簡単に行える）
tap "oven-sh/bun" # Bun（JavaScriptランタイム）のための専用タップ

# 開発ツールやユーティリティ
brew "alp" # アクセスログプロファイラ
brew "coreutils" # GNUコアユーティリティ
brew "cloc" # コード行数をカウントするツール
brew "cmake" # C++プロジェクトのビルドツール
brew "cpanminus" # Perlのモジュール管理ツール
brew "curl" # データ転送ツール（HTTP, FTPなど）
brew "direnv" # 環境変数の自動ロードツール
brew "gnu-time" # プロセス実行時間を計測するツール
brew "pinentry" # GPGのパスフレーズ入力用ツール
brew "wget" # ファイルダウンロードツール
brew "ffmpeg" # 動画・音声変換ツール

# プログラミング言語と関連ツール
brew "deno" # JavaScript/TypeScriptランタイム
brew "go" # Go言語
brew "perl" # Perlプログラミング言語
brew "protobuf" # Protocol Buffersのコンパイラ
brew "rbenv" # Rubyバージョン管理ツール
brew "rust" # Rustプログラミング言語
brew "rustup" # Rustのバージョン管理ツール
brew "zig" # Zigプログラミング言語
brew "oven-sh/bun/bun" # JavaScriptランタイムのBun

# バージョン管理関連ツール
brew "git" # Gitバージョン管理システム
brew "git-lfs" # Git Large File Storage
brew "gh" # GitHub CLI

# サーバー・データベース関連
brew "mysql" # MySQLデータベース
brew "postgresql@17", restart_service: true, link: true # PostgreSQLデータベース
brew "openssh" # SSH関連ツール

# その他
brew "ios-deploy" # iOSデバイスにアプリをデプロイするツール
brew "k6" # 負荷テストツール
brew "typst" # ドキュメント作成用の新しいマークアップ言語

# アプリケーション（Cask）
cask "background-music" # システムオーディオ管理アプリ
cask "font-plemol-jp" # Plemol JP フォント
cask "font-plemol-jp-hs" # Plemol JP ハーフスリムフォント
cask "font-plemol-jp-nf" # Plemol JP Nerd フォント
cask "git-credential-manager" # Git Credential Manager
cask "mactex" # LaTeX環境

# VSCode拡張機能
vscode "astro-build.astro-vscode" # Astroフレームワーク用拡張
vscode "bierner.markdown-mermaid" # Mermaidを用いたMarkdownサポート
vscode "biomejs.biome" # Biome（コードフォーマッター/リンター）用拡張
vscode "bradlc.vscode-tailwindcss" # Tailwind CSSサポート
vscode "csstools.postcss" # PostCSSサポート
vscode "dariofuzinato.vue-peek" # Vueファイルの参照を簡単にする拡張
vscode "dbaeumer.vscode-eslint" # ESLintサポート
vscode "eamodio.gitlens" # Git操作を便利にする拡張
vscode "ecmel.vscode-html-css" # HTMLとCSSのサポート
vscode "esbenp.prettier-vscode" # Prettierコードフォーマッター
vscode "formulahendry.code-runner" # 簡単にコードを実行できる拡張
vscode "github.copilot" # GitHub Copilot（AIペアプログラミング）
vscode "github.copilot-chat" # GitHub Copilot用チャット拡張
vscode "github.github-vscode-theme" # GitHub公式テーマ
vscode "golang.go" # Go言語サポート
vscode "graphql.vscode-graphql" # GraphQLサポート
vscode "graphql.vscode-graphql-syntax" # GraphQLシンタックスハイライト
vscode "james-yu.latex-workshop" # LaTeXサポート
vscode "jinliming2.vscode-go-template" # Goテンプレートエンジン用拡張
vscode "marp-team.marp-vscode" # Marpでプレゼンテーション作成
vscode "ms-ceintl.vscode-language-pack-ja" # 日本語言語パック
vscode "ms-dotnettools.csdevkit" # .NET開発キット
vscode "ms-dotnettools.csharp" # C#サポート
vscode "ms-dotnettools.vscode-dotnet-runtime" # .NETランタイムサポート
vscode "ms-dotnettools.vscodeintellicode-csharp" # .NETインテリジェンス拡張
vscode "ms-playwright.playwright" # Playwrightサポート
vscode "ms-python.debugpy" # Pythonデバッグ
vscode "ms-python.python" # Pythonサポート
vscode "ms-python.vscode-pylance" # 高速Python言語サーバー
vscode "ms-toolsai.jupyter" # Jupyter Notebookサポート
vscode "ms-toolsai.jupyter-keymap" # Jupyterキーマップ
vscode "ms-toolsai.jupyter-renderers" # Jupyter Notebookレンダラー
vscode "ms-toolsai.vscode-jupyter-cell-tags" # Jupyterセルタグサポート
vscode "ms-toolsai.vscode-jupyter-slideshow" # Jupyterスライドショーサポート
vscode "ms-vscode-remote.remote-containers" # Remote Containersサポート
vscode "ms-vscode-remote.remote-ssh" # Remote SSHサポート
vscode "ms-vscode-remote.remote-ssh-edit" # SSHリモート編集サポート
vscode "ms-vscode.cmake-tools" # CMakeツールサポート
vscode "ms-vscode.cpptools" # C++サポート
vscode "ms-vscode.cpptools-extension-pack" # C++拡張パック
vscode "ms-vscode.cpptools-themes" # C++用テーマ
vscode "ms-vscode.hexeditor" # バイナリファイル編集
vscode "ms-vscode.remote-explorer" # Remote Explorerサポート
vscode "ms-vsliveshare.vsliveshare" # リアルタイムコラボレーション
vscode "myriad-dreamin.tinymist" # TinyMistサポート
vscode "oderwat.indent-rainbow" # インデント可視化
vscode "pkief.material-icon-theme" # アイコンテーマ
vscode "prisma.prisma" # Prismaサポート
vscode "ritwickdey.liveserver" # Live Server拡張
vscode "rust-lang.rust-analyzer" # Rustサポート
vscode "stylelint.vscode-stylelint" # Stylelintサポート
vscode "svelte.svelte-vscode" # Svelteサポート
vscode "tauri-apps.tauri-vscode" # Tauriサポート
vscode "twxs.cmake" # CMakeサポート
vscode "unifiedjs.vscode-mdx" # MDXサポート
vscode "vadimcn.vscode-lldb" # LLDBデバッガ
vscode "vue.volar" # Vue 3サポート
vscode "yoavbls.pretty-ts-errors" # TypeScriptエラーを見やすく
vscode "zenn.zenn-preview" # Zenn記事プレビュー
