# Homebrew taps
tap "homebrew/bundle" # Bundle管理を行うための公式タップ
tap "homebrew/services" # サービス管理用のタップ（起動や停止などを簡単に行える）
tap "oven-sh/bun" # Bun（JavaScriptランタイム）のための専用タップ

# 開発ツールやユーティリティ
brew "alp" # アクセスログプロファイラ
brew "coreutils" # GNUコアユーティリティ
brew "cloc" # コード行数をカウントするツール
brew "cmake" # C++プロジェクトのビルドツール
brew "cpanminus" # Perlのモジュール管理ツール
brew "curl" # データ転送ツール（HTTP, FTPなど）
brew "direnv" # 環境変数の自動ロードツール
brew "gnu-time" # プロセス実行時間を計測するツール
brew "mise" # バージョン管理ツール
brew "pinentry" # GPGのパスフレーズ入力用ツール
brew "wget" # ファイルダウンロードツール
brew "ffmpeg" # 動画・音声変換ツール

# プログラミング言語と関連ツール
brew "deno" # JavaScript/TypeScriptランタイム
brew "go" # Go言語
brew "perl" # Perlプログラミング言語
brew "protobuf" # Protocol Buffersのコンパイラ
brew "rbenv" # Rubyバージョン管理ツール
brew "rust" # Rustプログラミング言語
brew "rustup" # Rustのバージョン管理ツール
brew "zig" # Zigプログラミング言語
brew "oven-sh/bun/bun" # JavaScriptランタイムのBun

# バージョン管理関連ツール
brew "git" # Gitバージョン管理システム
brew "git-lfs" # Git Large File Storage
brew "gh" # GitHub CLI

# サーバー・データベース関連
brew "mysql" # MySQLデータベース
brew "postgresql@17", restart_service: true, link: true # PostgreSQLデータベース
brew "openssh" # SSH関連ツール

# その他
brew "ios-deploy" # iOSデバイスにアプリをデプロイするツール
brew "k6" # 負荷テストツール
brew "typst" # ドキュメント作成用の新しいマークアップ言語
brew "mas" # Mac App Storeのアプリをコマンドラインからインストールするツール

# アプリケーション（Cask）
cask "google-chrome"
cask "firefox"
cask "microsoft-edge"
cask "arc"
cask "notion"
cask "discord"
cask "slack"
cask "mattermost"
cask "visual-studio-code"
cask "warp"
cask "dbeaver-community"
cask "wireshark"
cask "utm"
cask "docker"
cask "globalprotect"
cask "spotify"
cask "zoom"
cask "microsoft-office"
cask "microsoft-remote-desktop"
cask "git-credential-manager" # Git Credential Manager
cask "mactex" # LaTeX環境
cask "karabiner-elements" # キーバインド変更ツール

# フォント
cask "font-plemol-jp" # Plemol JP フォント
cask "font-plemol-jp-hs" # Plemol JP ハーフスリムフォント
cask "font-plemol-jp-nf" # Plemol JP Nerd フォント
cask "font-monaspace" # https://github.com/githubnext/monaspace